#if 0
;
; Note: shader requires additional functionality:
;       Resource descriptor heap indexing
;
; shader debug name: 6615c7762cf6206feb61259d19376858.pdb
; shader hash: 6615c7762cf6206feb61259d19376858
;
; Buffer Definitions:
;
; cbuffer t
; {
;
;   struct hostlayout.t
;   {
;
;       column_major float4x4 t;                      ; Offset:    0
;       uint UAV;                                     ; Offset:   64
;   
;   } t;                                              ; Offset:    0 Size:    68
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; t                                 cbuffer      NA          NA     CB0            cb0     1
; Scene                             texture     i32         ras      T0             t0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%dx.types.Handle = type { i8* }
%hostlayout.t = type { [4 x <4 x float>], i32 }
%struct.RayDesc = type { <3 x float>, float, <3 x float>, float }
%struct.RayPayload = type { <4 x float> }
%dx.types.ResourceProperties = type { i32, i32 }
%dx.types.CBufRet.i32 = type { i32, i32, i32, i32 }
%struct.BuiltInTriangleIntersectionAttributes = type { <2 x float> }
%struct.RaytracingAccelerationStructure = type { i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !49)
!1 = !DIFile(filename: "Renderer\5CShaders\5CRaytracingBasic.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 29, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 29, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 31, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 31, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 42, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 27, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 27, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32, !35, !46}
!32 = !DISubprogram(name: "RayGenMain", linkageName: "\01?RayGenMain@@YAXXZ", scope: !1, file: !1, line: 25, type: !33, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenMain@@YAXXZ")
!33 = !DISubroutineType(types: !34)
!34 = !{null}
!35 = !DISubprogram(name: "ClosestMain", linkageName: "\01?ClosestMain@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 52, type: !36, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestMain@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !42}
!38 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 7, size: 128, align: 32, elements: !40)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !39, file: !1, line: 9, baseType: !22, size: 128, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 3, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 49, size: 64, align: 32, elements: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !43, file: !1, line: 49, baseType: !5, size: 64, align: 32)
!46 = !DISubprogram(name: "MissMain", linkageName: "\01?MissMain@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 58, type: !47, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MissMain@@YAXURayPayload@@@Z")
!47 = !DISubroutineType(types: !48)
!48 = !{null, !38}
!49 = !{!50, !74, !78, !80}
!50 = !DIGlobalVariable(name: "t", linkageName: "\01?t@0@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 20, type: !51, isLocal: false, isDefinition: true)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 20, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 20, size: 512, align: 32, elements: !54, templateParams: !71)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !53, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!71 = !{!11, !72, !73}
!72 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!73 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!74 = !DIGlobalVariable(name: "UAV", linkageName: "\01?UAV@t@@3IB", scope: !0, file: !1, line: 21, type: !75, isLocal: false, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 21, baseType: !77)
!77 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!78 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 43, type: !79, isLocal: true, isDefinition: true, variable: i32 16)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!80 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 5, type: !81, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 5, size: 32, align: 32, elements: !2)
!82 = !{i32 2, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!85 = !{!"Renderer\5CShaders\5CRaytracingBasic.hlsl", !"//#include \22RaytracingCommon.hlsli\22\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0Astruct RayPayloadShadow\0D\0A{\0D\0A    bool IsOccluded;\0D\0A};\0D\0A\0D\0A\0D\0Acbuffer t : register(b0)\0D\0A{\0D\0A    float4x4 t;\0D\0A    uint UAV;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGenMain()\0D\0A{\0D\0A    RWTexture2D<float4> RenderTarget = ResourceDescriptorHeap[UAV];\0D\0A    \0D\0A    float2 lerpValues = (float2) DispatchRaysIndex() / (float2) DispatchRaysDimensions(); // 1280, 720 -> [0..1]\0D\0A    \0D\0A    float3 rayDir = float3(0, 0, 1);\0D\0A    float3 origin = float3(\0D\0A        lerp(-1.0f, 1.0f, lerpValues.x),\0D\0A        lerp(-1.0f, 1.0f, lerpValues.y),\0D\0A        0.0f);\0D\0A    \0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = rayDir;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A    \0D\0A    RayPayloadShadow s = { false };\0D\0A    \0D\0A    \0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestMain(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    payload.color = 1.0f.xxxx;\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MissMain(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float4(1.0f, 1.0f, 0.0f, 1.0f);\0D\0A}"}
!86 = !{!"Renderer\5CShaders\5CRaytracingBasic.hlsl"}
!87 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_6", !"/Od", !"/Zi", !"-Qembed_debug"}
!88 = !{i32 1, i32 6}
!89 = !{!"lib", i32 6, i32 6}
!90 = !{!91, null, !94, null}
!91 = !{!92}
!92 = !{i32 0, %struct.RaytracingAccelerationStructure* bitcast (%dx.types.Handle* @"\01?Scene@@3URaytracingAccelerationStructure@@A" to %struct.RaytracingAccelerationStructure*), !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !93}
!93 = !{i32 0, i32 4}
!94 = !{!95}
!95 = !{i32 0, %hostlayout.t* @t_legacy, !"t", i32 0, i32 0, i32 1, i32 68, null}
!96 = !{i32 0, %struct.RayDesc undef, !97, %struct.RayPayload undef, !102, %struct.RayPayloadShadow undef, !104, %struct.BuiltInTriangleIntersectionAttributes undef, !106, %hostlayout.t undef, !108}
!97 = !{i32 32, !98, !99, !100, !101}
!98 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!99 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!100 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!101 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!102 = !{i32 16, !103}
!103 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!104 = !{i32 4, !105}
!105 = !{i32 6, !"IsOccluded", i32 3, i32 0, i32 7, i32 1}
!106 = !{i32 8, !107}
!107 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!108 = !{i32 68, !109, !111}
!109 = !{i32 6, !"t", i32 2, !110, i32 3, i32 0, i32 7, i32 9}
!110 = !{i32 4, i32 4, i32 2}
!111 = !{i32 6, !"UAV", i32 3, i32 64, i32 7, i32 5, i32 9, i1 true}
!112 = !{i32 1, void ()* @"\01?RayGenMain@@YAXXZ", !113, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestMain@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !115, void (%struct.RayPayload*)* @"\01?MissMain@@YAXURayPayload@@@Z", !118}
!113 = !{!114}
!114 = !{i32 1, !2, !2}
!115 = !{!114, !116, !117}
!116 = !{i32 2, !2, !2}
!117 = !{i32 0, !2, !2}
!118 = !{!114, !116}
!119 = !{null, !"", null, !90, !120}
!120 = !{i32 0, i64 1073741825}
!121 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestMain@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestMain@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !122}
!122 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !123}
!123 = !{i32 0}
!124 = !{void (%struct.RayPayload*)* @"\01?MissMain@@YAXURayPayload@@@Z", !"\01?MissMain@@YAXURayPayload@@@Z", null, null, !125}
!125 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !123}
!126 = !{void ()* @"\01?RayGenMain@@YAXXZ", !"\01?RayGenMain@@YAXXZ", null, null, !127}
!127 = !{i32 8, i32 7, i32 5, !123}
!128 = !DILocation(line: 43, column: 5, scope: !32)
!129 = !DILocation(line: 27, column: 63, scope: !32)
!130 = !DILocation(line: 27, column: 40, scope: !32)
!131 = !DILocation(line: 29, column: 34, scope: !32)
!132 = !DILocation(line: 29, column: 65, scope: !32)
!133 = !DILocation(line: 29, column: 54, scope: !32)
!134 = !DILocation(line: 29, column: 12, scope: !32)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lerpValues", scope: !32, file: !1, line: 29, type: !4)
!136 = !DIExpression(DW_OP_bit_piece, 0, 32)
!137 = !DIExpression(DW_OP_bit_piece, 32, 32)
!138 = !DILocation(line: 31, column: 12, scope: !32)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !32, file: !1, line: 31, type: !14)
!140 = !DIExpression()
!141 = !DILocation(line: 33, column: 9, scope: !32)
!142 = !DILocation(line: 34, column: 9, scope: !32)
!143 = !DILocation(line: 32, column: 27, scope: !32)
!144 = !DILocation(line: 32, column: 12, scope: !32)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !32, file: !1, line: 32, type: !14)
!146 = !DIExpression(DW_OP_bit_piece, 64, 32)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !32, file: !1, line: 37, type: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 37, size: 256, align: 32, elements: !149)
!149 = !{!150, !151, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !148, file: !1, line: 37, baseType: !15, size: 96, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !148, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !148, file: !1, line: 37, baseType: !15, size: 96, align: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !148, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 224)
!154 = !DILocation(line: 37, column: 13, scope: !32)
!155 = !DILocation(line: 38, column: 9, scope: !32)
!156 = !DILocation(line: 38, column: 16, scope: !32)
!157 = !DILocation(line: 39, column: 9, scope: !32)
!158 = !DILocation(line: 39, column: 19, scope: !32)
!159 = !DILocation(line: 40, column: 9, scope: !32)
!160 = !DILocation(line: 40, column: 14, scope: !32)
!161 = !DILocation(line: 41, column: 9, scope: !32)
!162 = !DILocation(line: 41, column: 14, scope: !32)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !32, file: !1, line: 42, type: !39)
!164 = !DILocation(line: 42, column: 16, scope: !32)
!165 = !DILocation(line: 42, column: 26, scope: !32)
!166 = !DILocation(line: 45, column: 26, scope: !32)
!167 = !DILocation(line: 48, column: 52, scope: !32)
!168 = !DILocation(line: 48, column: 18, scope: !32)
!169 = !DILocation(line: 48, column: 42, scope: !32)
!170 = !DILocation(line: 49, column: 1, scope: !32)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !35, file: !1, line: 52, type: !42)
!172 = !DILocation(line: 52, column: 60, scope: !35)
!173 = !DILocation(line: 54, column: 21, scope: !35)
!174 = !DILocation(line: 54, column: 19, scope: !35)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !35, file: !1, line: 52, type: !39)
!176 = !DILocation(line: 52, column: 35, scope: !35)
!177 = !DIExpression(DW_OP_bit_piece, 96, 32)
!178 = !DILocation(line: 55, column: 1, scope: !35)
!179 = !DILocation(line: 60, column: 19, scope: !46)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !46, file: !1, line: 58, type: !39)
!181 = !DILocation(line: 58, column: 32, scope: !46)
!182 = !DILocation(line: 61, column: 1, scope: !46)

#endif

const unsigned char g_RaytracingBasic[] = {
  0x44, 0x58, 0x42, 0x43, 0x0f, 0x49, 0xe6, 0x80, 0xa2, 0xf5, 0x30, 0xdc,
  0xc3, 0xf0, 0x9b, 0x39, 0x23, 0xe7, 0xf6, 0x8f, 0x01, 0x00, 0x00, 0x00,
  0xb8, 0x36, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x3c, 0x00, 0x00, 0x00,
  0x4c, 0x00, 0x00, 0x00, 0x14, 0x02, 0x00, 0x00, 0x30, 0x21, 0x00, 0x00,
  0xe8, 0x2a, 0x00, 0x00, 0x1c, 0x2b, 0x00, 0x00, 0x38, 0x2b, 0x00, 0x00,
  0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02,
  0x00, 0x00, 0x00, 0x00, 0x52, 0x44, 0x41, 0x54, 0xc0, 0x01, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
  0xc8, 0x00, 0x00, 0x00, 0x18, 0x01, 0x00, 0x00, 0xac, 0x01, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0xa8, 0x00, 0x00, 0x00, 0x00, 0x74, 0x00, 0x53,
  0x63, 0x65, 0x6e, 0x65, 0x00, 0x01, 0x3f, 0x52, 0x61, 0x79, 0x47, 0x65,
  0x6e, 0x4d, 0x61, 0x69, 0x6e, 0x40, 0x40, 0x59, 0x41, 0x58, 0x58, 0x5a,
  0x00, 0x52, 0x61, 0x79, 0x47, 0x65, 0x6e, 0x4d, 0x61, 0x69, 0x6e, 0x00,
  0x01, 0x3f, 0x43, 0x6c, 0x6f, 0x73, 0x65, 0x73, 0x74, 0x4d, 0x61, 0x69,
  0x6e, 0x40, 0x40, 0x59, 0x41, 0x58, 0x55, 0x52, 0x61, 0x79, 0x50, 0x61,
  0x79, 0x6c, 0x6f, 0x61, 0x64, 0x40, 0x40, 0x55, 0x42, 0x75, 0x69, 0x6c,
  0x74, 0x49, 0x6e, 0x54, 0x72, 0x69, 0x61, 0x6e, 0x67, 0x6c, 0x65, 0x49,
  0x6e, 0x74, 0x65, 0x72, 0x73, 0x65, 0x63, 0x74, 0x69, 0x6f, 0x6e, 0x41,
  0x74, 0x74, 0x72, 0x69, 0x62, 0x75, 0x74, 0x65, 0x73, 0x40, 0x40, 0x40,
  0x5a, 0x00, 0x43, 0x6c, 0x6f, 0x73, 0x65, 0x73, 0x74, 0x4d, 0x61, 0x69,
  0x6e, 0x00, 0x01, 0x3f, 0x4d, 0x69, 0x73, 0x73, 0x4d, 0x61, 0x69, 0x6e,
  0x40, 0x40, 0x59, 0x41, 0x58, 0x55, 0x52, 0x61, 0x79, 0x50, 0x61, 0x79,
  0x6c, 0x6f, 0x61, 0x64, 0x40, 0x40, 0x40, 0x5a, 0x00, 0x4d, 0x69, 0x73,
  0x73, 0x4d, 0x61, 0x69, 0x6e, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00,
  0x48, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x20, 0x00, 0x00, 0x00,
  0x02, 0x00, 0x00, 0x00, 0x0d, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
